/*Дано слово. Вывести а на экран его третий символ*/

class P8_9_13{
	public static void main(String[] args) {
		String word = "Malika";
	    char b = word.charAt(3);

	    System.out.println(b);
	}
}